In [1]:
#Importing Packages
import pandas as pd
import numpy as np
from datetime import datetime

# Setting a random seed for reproducibility
np.random.seed(42)

# Data Preprocessing Notebook

This notebook contains various data preprocessing steps for our dataset. Below is a summary of the steps taken:

1. Handling Missing Data
2. Handling Categorical Data
3. Standardizing Numeric Data
4. Feature Engineering

In [2]:
#load data
path = "../data/raw/data_science_competition_2024.csv"
df = pd.read_csv(path)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 21 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Unnamed: 0            100000 non-null  int64
 1   loan_id               100000 non-null  object
 2   gender                100000 non-null  object
 3   disbursemet_date      100000 non-null  object
 4   currency              100000 non-null  object
 5   country               99900 non-null   object
 6   sex                   100000 non-null  object
 7   is_employed           100000 non-null  bool
 8   job                   95864 non-null   object
 9   location              99405 non-null   object
 10  loan_amount           100000 non-null  float64
 11  number_of_defaults    100000 non-null  int64
 12  outstanding_balance   100000 non-null  float64
 13  interest_rate         100000 non-null  float64
 14  age                   100000 non-null  int64
 15  number_of_defaults.1  100000 non-null  int64
 16  remaining term        100000 non-null  object
 17  salary                100000 non-null  float64
 18  marital_status        100000 non-null  object
 19  age.1                 100000 non-null  int64
 20  Loan Status           100000 non-null  object
dtypes: bool(1), float64(4), int64(5), object(11)
memory usage: 15.4+ MB

In [3]:
df.describe()

,Unnamed: 0,loan_amount,number_of_defaults,outstanding_balance,interest_rate,age,number_of_defaults.1,salary,age.1
count,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.00000,100000.000000,100000.000000,100000.00000
mean,49999.500000,31120.000000,0.441970,36964.909763,0.210435,43.57069,0.441970,2781.804324,43.57069
std,28867.657797,15895.093631,0.688286,10014.758477,0.018725,4.86376,0.688286,696.450055,4.86376
min,0.000000,1000.000000,0.000000,0.000000,0.100000,21.00000,0.000000,250.000000,21.00000
25%,24999.750000,21000.000000,0.000000,29625.227472,0.200000,40.00000,0.000000,2273.929349,40.00000
50%,49999.500000,31000.000000,0.000000,35063.852394,0.210000,44.00000,0.000000,2665.441567,44.00000
75%,74999.250000,40000.000000,1.000000,42133.388817,0.220000,47.00000,1.000000,3146.577655,47.00000
max,99999.000000,273000.000000,2.000000,150960.000000,0.300000,65.00000,2.000000,10000.000000,65.00000

In [4]:
df.shape

(100000, 21)

In [5]:
df.isnull().sum()

Unnamed: 0                 0
loan_id                    0
gender                     0
disbursemet_date           0
currency                   0
country                  100
sex                        0
is_employed                0
job                     4136
location                 595
loan_amount                0
number_of_defaults         0
outstanding_balance        0
interest_rate              0
age                        0
number_of_defaults.1       0
remaining term             0
salary                     0
marital_status             0
age.1                      0
Loan Status                0
dtype: int64

In [6]:
df['country'].unique()

array(['Zimbabwe', 'zimbabwe', 'Zim', nan], dtype=object)

In [7]:
df['country'].value_counts()

country
Zimbabwe    99787
zimbabwe      100
Zim            13
Name: count, dtype: int64

In [8]:
# Standizing and Handling Missing Data
# Filling values in the 'country' column with 'Zimbabwe'

df['country'] = 'Zimbabwe'



The dataset contained multiple variations of the country name 'Zimbabwe' and some missing values. To standardize the data, I updated the entire column to 'Zimbabwe'.

In [9]:
df['job'].value_counts()

job
Engineer              16524
Nurse                 15284
Data Analyst          13204
Doctor                12186
Software Developer    11932
Teacher                8950
Accountant             7802
SoftwareDeveloper      3564
Data Scientist         3521
Lawyer                 2862
Data Scintist            35
Name: count, dtype: int64

In [10]:
df['job'].unique()

array(['Teacher', 'Nurse', 'Doctor', 'Data Analyst', 'Software Developer',
       'Accountant', 'Lawyer', 'Engineer', nan, 'Data Scientist',
       'SoftwareDeveloper', 'Data Scintist'], dtype=object)

In [11]:
df['job'].replace({'Data Scintist': 'Data Scientist', 'SoftwareDeveloper': 'Software Developer'}, inplace=True)

C:\Users\usar\AppData\Local\Temp\ipykernel_30484\3866008592.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['job'].replace({'Data Scintist': 'Data Scientist', 'SoftwareDeveloper': 'Software Developer'}, inplace=True)

In [12]:
df['job'].fillna('Unknown', inplace=True)

To handle the missing values, l used the fillna() method to replace NaN values with a specified value, such as 'Unknown'. This ensures that there are no missing values in the column, which is crucial for data analysis and model training.
The job column contains variations of the same job title, such as 'Data Scientist', 'Data Scintist', and 'Software Developer', 'SoftwareDeveloper'. These variations can cause issues in analysis and modeling because they are treated as different categories.

In [13]:
df['location'].unique()

array(['Beitbridge', 'Harare', 'Gweru', 'Rusape', 'Chipinge',
       'Chimanimani', 'Marondera', 'Kadoma', 'Mutare', 'Masvingo',
       'Bulawayo', 'Kariba', 'Plumtree', 'Chiredzi', 'Shurugwi', 'Chivhu',
       'Zvishavane', 'Nyanga', 'Karoi', 'Redcliff', 'Kwekwe', ' Karoi ',
       'Gokwe', 'Victoria Falls', ' Masvingo ', '   Chipinge   ',
       ' Mutare ', nan, '   Mutare ', ' Marondera   ', '   Rusape   ',
       ' Bulawayo   ', 'Chivhu ', ' Chimanimani   ', 'Plumtree   ',
       '   Masvingo   ', '   Gweru ', '   Chivhu   ', 'Mutare   ',
       ' Kwekwe ', 'Marondera   ', ' Chipinge   ', '   Mutare   ',
       '   Karoi   ', ' Beitbridge   ', '   Karoi ', ' Beitbridge ',
       ' Mutare   ', '   Bulawayo ', 'Masvingo   ', ' Kadoma   ',
       ' Plumtree ', 'Marondera ', '   Plumtree ', ' Chipinge ',
       '   Harare ', 'Harare   ', ' Nyanga   ', ' Gweru   ', 'Rusape   ',
       'Masvingo ', '   Harare   ', ' Kadoma ', 'Bulawayo   ',
       ' Kwekwe   ', 'Hwange', ' Harare ', '   Marondera   ',
       'Chipinge   ', '   Marondera ', '   Beitbridge ', 'Karoi   ',
       'Chimanimani ', ' Bulawayo ', 'Chivhu   ', 'Kwekwe ', ' Kariba   ',
       ' Marondera ', 'Plumtree ', '   Bulawayo   ', 'Karoi ',
       ' Chivhu   ', '   Nyanga ', '   Chipinge ', ' Rusape   ',
       '   Beitbridge   ', ' Harare   ', ' Chivhu ', ' Gweru ',
       ' Kariba ', 'Harare ', ' Chimanimani ', 'Beitbridge   ',
       '   Chivhu ', '   Gweru   ', 'Chiredzi ', ' Masvingo   ',
       ' Zvishavane ', 'Mutare ', '   Chiredzi ', 'Gweru ', 'Gweru   ',
       ' Plumtree   ', 'Chiredzi   ', ' Chiredzi ', 'Chipinge ',
       ' Rusape ', '   Plumtree   ', '   Kadoma   ', 'Rusape ',
       ' Zvishavane   ', '   Masvingo ', 'Nyanga   ', '   Kwekwe   ',
       'Chimanimani   ', ' Chiredzi   ', ' Karoi   ', 'Shurugwi ',
       'Gokwe ', 'Zvishavane   ', '   Chimanimani ', '   Gokwe ',
       'Bulawayo ', '   Shurugwi ', '   Zvishavane   ', 'Beitbridge ',
       '   Chimanimani   ', ' Redcliff ', 'Kadoma   ', 'Kwekwe   ',
       ' Gokwe ', '   Kadoma ', '   Kwekwe ', '   Shurugwi   ',
       '   Nyanga   ', 'Zvishavane ', 'Kariba ', ' Shurugwi   ',
       ' Shurugwi ', '   Rusape ', '   Chiredzi   ', '   Redcliff   ',
       '   Kariba   ', 'Victoria Falls   ', 'Shurugwi   ', ' Nyanga ',
       'Victoria Falls ', '   Gokwe   ', 'Kariba   ', ' Victoria Falls ',
       '   Victoria Falls ', 'Nyanga ', 'Kadoma ', ' Gokwe   ',
       '   Kariba ', '   Zvishavane ', ' Victoria Falls   ', 'Gokwe   '],
      dtype=object)

In [14]:
# Remove leading and trailing whitespace
df['location'] = df['location'].str.strip()

In [15]:
# Replace multiple spaces with a single space
df['location'] = df['location'].str.replace(r'\s+', ' ', regex=True)

In [16]:
# Replace variations of locations with a standard value
standard_locations = {
    'Karoi': 'Karoi',
    'Masvingo': 'Masvingo',
    'Chipinge': 'Chipinge',
    'Mutare': 'Mutare',
    'Chivhu': 'Chivhu',
    'Gweru': 'Gweru',
    'Plumtree': 'Plumtree',
    'Chiredzi': 'Chiredzi',
    'Bulawayo': 'Bulawayo',
    'Harare': 'Harare',
    'Nyanga': 'Nyanga',
    'Kadoma': 'Kadoma',
    'Kwekwe': 'Kwekwe',
    'Chimanimani': 'Chimanimani',
    'Beitbridge': 'Beitbridge',
    'Zvishavane': 'Zvishavane',
    'Gokwe': 'Gokwe',
    'Victoria Falls': 'Victoria Falls',
    'Redcliff': 'Redcliff',
    'Kariba': 'Kariba',
    'Shurugwi': 'Shurugwi',
    'Rusape': 'Rusape'
}

In [17]:
df['location'] = df['location'].replace(standard_locations)

In [18]:
df['location'].value_counts()

location
Harare            8553
Bulawayo          8263
Mutare            8262
Gweru             7983
Masvingo          7665
Marondera         7513
Rusape            6506
Chivhu            6411
Plumtree          5552
Beitbridge        5311
Chipinge          4447
Chimanimani       4388
Kwekwe            3491
Chiredzi          3199
Kadoma            3118
Nyanga            2142
Karoi             1899
Shurugwi          1359
Zvishavane        1301
Gokwe              920
Kariba             671
Victoria Falls     219
Redcliff           191
Hwange              41
Name: count, dtype: int64

In [19]:
df['gender'].unique()

array(['female', 'other', 'male'], dtype=object)

In [20]:
df['gender'].value_counts()

gender
male      35028
female    32685
other     32287
Name: count, dtype: int64

In [21]:
df['sex'].unique()

array(['female', 'other', 'male'], dtype=object)

In [22]:
df['sex'].value_counts()

sex
male      35028
female    32685
other     32287
Name: count, dtype: int64

In [23]:
# Drop column 'sex' since it is a duplication of gender
df = df.drop('sex', axis=1)

In [24]:
df['disbursemet_date'].dtype

dtype('O')

In [25]:
#rename column
df.rename(columns={'disbursemet_date': 'disbursement_date'}, inplace=True)

In [26]:
df['disbursement_date'].head()

0    2022 10 29
1    2020 06 06
2    2023 09 29
3    2022 06 22
4    2023 02 08
Name: disbursement_date, dtype: object

In [27]:
# Convert 'disbursement_date' to datetime
df['disbursement_date'] = pd.to_datetime(df['disbursement_date'], format='%Y %m %d')

In [28]:
df['disbursement_date'].value_counts()

disbursement_date
2020-09-24    103
2021-04-13     95
2020-11-27     92
2022-03-31     91
2022-04-07     90
             ...
2023-04-03     46
2020-04-06     45
2021-03-28     44
2020-08-25     42
2021-07-11     41
Name: count, Length: 1461, dtype: int64

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Unnamed: 0            100000 non-null  int64
 1   loan_id               100000 non-null  object
 2   gender                100000 non-null  object
 3   disbursement_date     100000 non-null  datetime64[ns]
 4   currency              100000 non-null  object
 5   country               100000 non-null  object
 6   is_employed           100000 non-null  bool
 7   job                   100000 non-null  object
 8   location              99405 non-null   object
 9   loan_amount           100000 non-null  float64
 10  number_of_defaults    100000 non-null  int64
 11  outstanding_balance   100000 non-null  float64
 12  interest_rate         100000 non-null  float64
 13  age                   100000 non-null  int64
 14  number_of_defaults.1  100000 non-null  int64
 15  remaining term        100000 non-null  object
 16  salary                100000 non-null  float64
 17  marital_status        100000 non-null  object
 18  age.1                 100000 non-null  int64
 19  Loan Status           100000 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(4), int64(5), object(9)
memory usage: 14.6+ MB

In [30]:
df['currency'].unique()

array(['USD', '$USD'], dtype=object)

In [31]:
#standardising currency
df['currency'].replace({'$USD': 'USD'}, inplace=True)

C:\Users\usar\AppData\Local\Temp\ipykernel_30484\3899308419.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['currency'].replace({'$USD': 'USD'}, inplace=True)

In [32]:
df.head()

,Unnamed: 0,loan_id,gender,disbursement_date,currency,country,is_employed,job,location,loan_amount,number_of_defaults,outstanding_balance,interest_rate,age,number_of_defaults.1,remaining term,salary,marital_status,age.1,Loan Status
0,0,8d05de78-ff32-46b1-aeb5-b3190f9c158a,female,2022-10-29,USD,Zimbabwe,True,Teacher,Beitbridge,39000.0,0,48653.011473,0.22,37,0,47,3230.038869,married,37,Did not default
1,1,368bf756-fcf2-4822-9612-f445d90b485b,other,2020-06-06,USD,Zimbabwe,True,Teacher,Harare,27000.0,2,28752.062237,0.20,43,2,62,3194.139103,single,43,Did not default
2,2,6e3be39e-49b5-45b5-aab6-c6556de53c6f,other,2023-09-29,USD,Zimbabwe,True,Nurse,Gweru,35000.0,1,44797.554126,0.22,43,1,57,3330.826656,married,43,Did not default
3,3,191c62f8-2211-49fe-ba91-43556b307871,female,2022-06-22,USD,Zimbabwe,True,Doctor,Rusape,24000.0,0,35681.496413,0.23,47,0,42,2246.797020,divorced,47,Did not default
4,4,477cd8a1-3b01-4623-9318-8cd6122a8346,male,2023-02-08,USD,Zimbabwe,True,Nurse,Chipinge,19000.0,0,34156.055882,0.20,42,0,45,2310.858441,married,42,Did not default

In [33]:
df['is_employed'].unique()

array([ True, False])

In [34]:
df['is_employed'].value_counts()

is_employed
True     95864
False     4136
Name: count, dtype: int64

In [35]:
df['loan_amount'].dtype

dtype('float64')

In [36]:
df['is_employed'].describe()

count     100000
unique         2
top         True
freq       95864
Name: is_employed, dtype: object

In [37]:
df['number_of_defaults'].dtype

dtype('int64')

In [38]:
df['number_of_defaults'].describe()

count    100000.000000
mean          0.441970
std           0.688286
min           0.000000
25%           0.000000
50%           0.000000
75%           1.000000
max           2.000000
Name: number_of_defaults, dtype: float64

In [39]:
df['outstanding_balance'].describe()

count    100000.000000
mean      36964.909763
std       10014.758477
min           0.000000
25%       29625.227472
50%       35063.852394
75%       42133.388817
max      150960.000000
Name: outstanding_balance, dtype: float64

In [40]:
df['interest_rate'].describe()

count    100000.000000
mean          0.210435
std           0.018725
min           0.100000
25%           0.200000
50%           0.210000
75%           0.220000
max           0.300000
Name: interest_rate, dtype: float64

In [41]:
df['number_of_defaults.1'].describe()

count    100000.000000
mean          0.441970
std           0.688286
min           0.000000
25%           0.000000
50%           0.000000
75%           1.000000
max           2.000000
Name: number_of_defaults.1, dtype: float64

In [42]:
df['number_of_defaults'].equals(df['number_of_defaults.1'])

True

In [43]:
#dropping number_deadults.1 since it is a duplication of number_of_defaults
df.drop('number_of_defaults.1', axis=1, inplace=True)

In [44]:
df.rename(columns={'remaining term': 'remaining_term'}, inplace=True)

In [45]:
df['remaining_term'].unique()

array(['47', '62', '57', '42', '45', '44', '52', '46', '43', '50', '68',
       '49', '54', '58', '30', '81', '75', '71', '63', '48', '51', '41',
       '64', '69', '39', '67', '83', '66', '56', '55', '61', '35', '77',
       '53', '72', '25', '36', '40', '80', '52   ', '59', '32', '65',
       '54   ', '34', '60', '69_', '74', '84', '41_', '78', '55   ', '73',
       '86', '37', '34_', '60   ', '89', '38', '76', '14', '53_', '70',
       '58_', '65   ', '49   ', '26', '58   ', '62   ', '33', '28', '27',
       '82', '38_', '47_', '57_', '22', '85', '56   ', '61   ', '52_',
       '44_', '45_', '51_', '73   ', '31', '63   ', '29', '65_', '48_',
       '47   ', '11', '40   ', '64   ', '87', '39_', '53   ', '59_',
       '64_', '33_', '92', '61_', '51   ', '18', '62_', '21', '39   ',
       '42   ', '59   ', '71   ', '50_', '82   ', '78_', '79', '55_',
       '56_', '23', '67   ', '57   ', '49_', '17', '20', '46_', '45   ',
       '24', '29_', '91', '68_', '93', '43   ', '50   ', '69   ', '38   ',
       '48   ', '68   ', '88', '67_', '74_', '100', '42_', '76   ', '60_',
       '90', '30_', '72_', '66_', '31_', '46   ', '97', '54_', '34   ',
       '72   ', '32   ', '28_', '19', '102', '44   ', '112', '33   ',
       '15', '103', '105', '14_', '40_', '35_', '116', '32_', '107',
       '120', '63_', '73_', '66   ', '79   ', '36   ', '75_', '13',
       '41   ', '81_', '19   ', '70   ', '76_', '31   ', '25   ', '16',
       '36_', '37   ', '93   ', '20   ', '43_', '95', '71_', '29   ',
       '26_', '28   ', '27   ', '104', '77_', '80   ', '74   ', '27_',
       '19_', '88_', '30   ', '106', '9', '35   ', '89   ', '78   ',
       '37_', '70_', '77   ', '15   ', '101', '108', '94', '75   ', '79_',
       '99', '96', '26   ', '81   ', '98', '111', '83_', '80_', '2', '12',
       '86   ', '0', '22   ', '10', '84   ', '21   ', '96   ', '94_',
       '89_', '83   ', '22_', '2_', '7', '25_', '82_', '86_', '20_',
       '14   ', '88   ', '90   ', '85_', '17_', '18_', '8', '12_',
       '17   ', '85   ', '114', '91_', '84_', '16_', '5', '94   ', '13_',
       '90_'], dtype=object)

It appears that the data in the column contains some inconsistencies such as trailing whitespaces, underscores, and other non-numeric characters.l will clean up this data and ensure it consists only of numeric values

In [46]:
df['remaining_term'] = df['remaining_term'].str.strip()

In [47]:
df['remaining_term'] = df['remaining_term'].str.replace('_', '')

In [48]:
df['remaining_term'] = pd.to_numeric(df['remaining_term'], errors='coerce')  # Convert to numeric, coerce errors to NaN

In [49]:
df['remaining_term'].unique()

array([ 47,  62,  57,  42,  45,  44,  52,  46,  43,  50,  68,  49,  54,
        58,  30,  81,  75,  71,  63,  48,  51,  41,  64,  69,  39,  67,
        83,  66,  56,  55,  61,  35,  77,  53,  72,  25,  36,  40,  80,
        59,  32,  65,  34,  60,  74,  84,  78,  73,  86,  37,  89,  38,
        76,  14,  70,  26,  33,  28,  27,  82,  22,  85,  31,  29,  11,
        87,  92,  18,  21,  79,  23,  17,  20,  24,  91,  93,  88, 100,
        90,  97,  19, 102, 112,  15, 103, 105, 116, 107, 120,  13,  16,
        95, 104, 106,   9, 101, 108,  94,  99,  96,  98, 111,   2,  12,
         0,  10,   7,   8, 114,   5], dtype=int64)

In [50]:
df['salary'].describe()

count    100000.000000
mean       2781.804324
std         696.450055
min         250.000000
25%        2273.929349
50%        2665.441567
75%        3146.577655
max       10000.000000
Name: salary, dtype: float64

In [51]:
df['marital_status'].unique()

array(['married', 'single', 'divorced', ' '], dtype=object)

In [52]:
df['marital_status'].value_counts()

marital_status
married     44710
divorced    26465
single      25698
             3127
Name: count, dtype: int64

l will handle the empty string values (' ') in the marital_status column and possibly replace them with a meaningful category such as 'unknown'

In [53]:
df['marital_status'] = df['marital_status'].replace(' ', 'unknown')

In [54]:
df['age'].equals(df['age.1'])

True

In [55]:
#dropping age.1 since it is a duplication of age
df.drop('age.1', axis=1, inplace=True)
df.drop('loan_id', axis=1, inplace=True)

In [56]:
#renaming loan status loan_status
df.rename(columns={'Loan Status': 'loan_status'}, inplace=True)

In [57]:
df['loan_status'].unique()

array(['Did not default', 'Defaulted'], dtype=object)

In [58]:
df['loan_status'].value_counts()

loan_status
Did not default    85134
Defaulted          14866
Name: count, dtype: int64

In [59]:
df.head(10)

,Unnamed: 0,gender,disbursement_date,currency,country,is_employed,job,location,loan_amount,number_of_defaults,outstanding_balance,interest_rate,age,remaining_term,salary,marital_status,loan_status
0,0,female,2022-10-29,USD,Zimbabwe,True,Teacher,Beitbridge,39000.0,0,48653.011473,0.22,37,47,3230.038869,married,Did not default
1,1,other,2020-06-06,USD,Zimbabwe,True,Teacher,Harare,27000.0,2,28752.062237,0.20,43,62,3194.139103,single,Did not default
2,2,other,2023-09-29,USD,Zimbabwe,True,Nurse,Gweru,35000.0,1,44797.554126,0.22,43,57,3330.826656,married,Did not default
3,3,female,2022-06-22,USD,Zimbabwe,True,Doctor,Rusape,24000.0,0,35681.496413,0.23,47,42,2246.797020,divorced,Did not default
4,4,male,2023-02-08,USD,Zimbabwe,True,Nurse,Chipinge,19000.0,0,34156.055882,0.20,42,45,2310.858441,married,Did not default
5,5,other,2020-11-15,USD,Zimbabwe,True,Data Analyst,Chimanimani,29000.0,0,37778.075179,0.21,46,44,2633.653709,single,Did not default
6,6,male,2023-11-09,USD,Zimbabwe,True,Teacher,Harare,24000.0,0,28675.968452,0.22,47,52,2554.371003,single,Did not default
7,7,female,2021-03-18,USD,Zimbabwe,True,Data Analyst,Marondera,38000.0,1,38406.933711,0.22,39,46,2847.991485,married,Did not default
8,8,other,2020-04-04,USD,Zimbabwe,True,Nurse,Kadoma,23000.0,0,28015.543801,0.22,46,47,2521.387875,married,Did not default
9,9,male,2020-12-03,USD,Zimbabwe,True,Nurse,Marondera,50000.0,1,61800.467639,0.24,37,43,2799.437570,divorced,Did not default

l am adding a new column target based on the values in the loan_status column, where 'Did not default' corresponds to False and 'Defaulted' corresponds to True

In [60]:

def map_loan_status(status):
    status_map = {
        'Did not default': False,
        'Defaulted': True
    }
    return status_map.get(status, None)

In [61]:
df['target'] = df['loan_status'].apply(lambda x: map_loan_status(x))

In [62]:
df.head()

,Unnamed: 0,gender,disbursement_date,currency,country,is_employed,job,location,loan_amount,number_of_defaults,outstanding_balance,interest_rate,age,remaining_term,salary,marital_status,loan_status,target
0,0,female,2022-10-29,USD,Zimbabwe,True,Teacher,Beitbridge,39000.0,0,48653.011473,0.22,37,47,3230.038869,married,Did not default,False
1,1,other,2020-06-06,USD,Zimbabwe,True,Teacher,Harare,27000.0,2,28752.062237,0.20,43,62,3194.139103,single,Did not default,False
2,2,other,2023-09-29,USD,Zimbabwe,True,Nurse,Gweru,35000.0,1,44797.554126,0.22,43,57,3330.826656,married,Did not default,False
3,3,female,2022-06-22,USD,Zimbabwe,True,Doctor,Rusape,24000.0,0,35681.496413,0.23,47,42,2246.797020,divorced,Did not default,False
4,4,male,2023-02-08,USD,Zimbabwe,True,Nurse,Chipinge,19000.0,0,34156.055882,0.20,42,45,2310.858441,married,Did not default,False

In [63]:
#exporting the processed data to csv:

timestamp = datetime.now().strftime("%Y%m%d_%H%M%S")
output_path = f'../data/processed/cleaned_data_{timestamp}.csv'
df.to_csv(output_path, index=False)

Here's a summary of the data preprocessing steps l performed:

---

### Data Preprocessing Summary

#### 1. **Handling Missing Data**

- **Country Column:** Filled missing values with 'Zimbabwe' due to majority presence and the dataset's focus.

#### 2. **Handling Categorical Data**

- **Marital Status Column:** Mapped empty strings to 'Unknown' for clarity and consistency.

#### 3. **Standardizing Numeric Data**

- **Age Column:** Cleaned trailing whitespace and converted to integer type.

#### 4. **Feature Engineering**

- **Loan Status Column:** Created a new binary column 'target' based on 'loan_status':
  - 'Did not default' mapped to `False`.
  - 'Defaulted' mapped to `True`.

#### 5. **Function Refactoring**

- **Mapping Function:** Refactored `map_loan_status` to handle 'Did not default', 'Defaulted', and other cases gracefully.